export const DUMMY = [
  {
    id: 0,
    promptList: [
      {
        prompt: 'GPT에게 어떻게 질문하는게 좋은가요?',
        answer:
          'GPT는 자연어 처리 기술을 이용해 대화하는 인공지능 모델입니다. 따라서 가능한 자연스럽고 명확한 문장으로 질문을 작성하는 것이 좋습니다.\n\n다음은 GPT에게 질문할 때 유의할 점입니다.\n간단하고 명확한 질문을 하세요: GPT는 복잡한 질문보다는 간단하고 명확한 질문에 더 잘 대답합니다. 따라서 질문이 길고 복잡하면 답변이 이해하기 어려울 수 있습니다.\n구체적인 질문을 하세요: 가능한 구체적으로 질문을 작성하면 GPT가 답변하기 쉬워집니다. 구체적인 예시를 들면, "얼마나 자주 운동해야 하나요?" 대신에 "주당 몇 번 운동하는 것이 좋은가요?"와 같이 질문을 작성하는 것입니다.\n올바른 문법과 철자를 사용하세요: GPT는 문법적으로 정확하고 철자가 올바른 질문에 더 잘 대답합니다. 따라서 가능한 올바른 문법과 철자를 사용하여 질문을 작성하는 것이 좋습니다.\n단순하지만 상세한 답변을 요구하세요: GPT는 간단한 질문에 대해서도 상세한 답변을 제공할 수 있습니다. 따라서 단순하지만 상세한 답변을 요구하는 질문을 작성하는 것이 좋습니다.\n문맥을 고려하세요: GPT는 이전의 대화 내용을 기억할 수 있습니다. 따라서 질문을 작성할 때 이전 대화 내용을 고려하여 문맥을 제공하는 것이 좋습니다.',
      },
      {
        prompt: '이전 대화내용을 기억한다면 끊임없이 계속 문맥을 파악하나요?',
        answer:
          'GPT는 이전 대화내용을 기억하는 능력이 있지만, 모델이 끊임없이 계속 문맥을 파악하도록 되어있지는 않습니다.\nGPT는 일반적으로 각 대화가 독립적인 것으로 처리하고, 각 대화마다 입력받은 문장들만을 고려하여 답변을 생성합니다.\n그러나 이전 대화내용이 적절한 문맥을 제공하는 경우, GPT는 이를 참고하여 보다 정확한 답변을 생성할 수 있습니다.\n따라서, 이전 대화내용이 답변 생성에 중요한 역할을 하는 경우에는 이를 명시적으로 입력하거나, 대화 상황을 직접 설명하여 모델에게 문맥을 이해시키는 것이 좋습니다.',
      },
    ],
    addQuestion:
      '1. GPT로 어떤 것들을 하면 편리한가요?\n2. 딥러닝이 무엇인가요?\n3. 프롬프트란 무엇인가요?',
  },
  {
    id: 1,
    promptList: [
      {
        prompt: '창업 아이템 3개만 추천해 주세요.',
        answer:
          '물론입니다! 여기 창업 아이디어 3가지를 제안해 드리겠습니다.\n\n지역 재료에 기반한 레스토랑 또는 식료품 가게: 지역 재료를 사용하는 것은 환경 친화적이며 지역 경제를 지원하는 것과 같은 이점이 있습니다. 이 아이디어는 특히 지역적인 특색이 강한 지역에서 잘 들어맞을 것입니다. 예를 들어 해산물이 풍부한 지역에서는 지역 해산물을 사용한 레스토랑이나 수산물 가게가 인기가 있을 것입니다.\n손쉬운 DIY 제품 제작 키트: DIY 제품 제작에 관심이 있는 사람들을 대상으로 한 제품 제작 키트는 인기가 있습니다. 이 아이디어는 다양한 분야에서 적용될 수 있습니다. 예를 들어, 조명, 가구, 액세서리 등 다양한 분야에서 손쉽게 제품을 만들 수 있는 키트를 제공하는 것입니다.\n\n체험 기반의 여행 사업: 많은 사람들이 여행을 즐기며 새로운 경험을 찾고 있습니다. 이 아이디어는 일반적인 관광지나 투어와는 조금 다르게 체험 중심의 여행을 제공하는 것입니다. 예를 들어, 지역 문화 체험, 음식 체험, 액티비티 체험 등을 제공하여 고객들이 독특한 경험을 즐길 수 있도록 하는 것입니다.',
      },
      {
        prompt: '손쉬운 DIY 제품 제작 키트가 뭐에요?',
        answer:
          '손쉬운 DIY 제품 제작 키트란, 사용자가 쉽게 직접 제품을 만들 수 있는 도구와 자재가 포함된 제품입니다.\n이 제품은 종종 일반적인 가구, 조명, 액세서리 등을 만들 수 있는 다양한 종류가 있습니다.\n예를 들어, 가구를 만드는 경우, 목재와 함께 조립 방법과 설명서가 제공됩니다.\n조명을 만드는 경우, 필요한 재료와 전구, 전선 등이 포함된 패키지가 제공됩니다.\n액세서리를 만드는 경우, 비슷한 방식으로 필요한 재료와 도구, 디자인 가이드 등이 포함됩니다.\n이러한 DIY 제품 제작 키트는 종종 인터넷 쇼핑몰이나 전문 쇼핑몰에서 구매할 수 있으며, 일부는 구독 서비스로 제공됩니다.\n이 아이디어는 직접 제품을 만들고 싶은데 제작 방법이나 도구가 부족한 분들이나 DIY 제품 제작에 관심이 있는 분들에게 적합합니다.',
      },
    ],
    addQuestion:
      '1. 창업 시작 전에 해야할 것들이 있나요?\n2. DIY 제품 제작 키트 중에서 어떤 아이템을 선정하면 좋을까요?\n3. 손재주가 없는데 DIY관련 사업을 해도 될까요?',
  },
  {
    id: 2,
    promptList: [
      {
        prompt: '오사카 2박3일 여행 계획 좀 세워주세요',
        answer:
          '오사카는 일본에서 가장 인기있는 여행지 중 하나로, 맛있는 음식과 멋진 관광지가 많은 도시입니다. 2박 3일 동안 오사카를 즐기기 위한 여행 계획을 제안해드리겠습니다.\n\nDay 1:\n오전: 신사이바시 상점가에서 쇼핑하기\n오후: 오사카성 방문하기\n저녁: 도톤보리에서 지역 음식 맛보기 (예: 오코노미야키, 타코야키, 꼬치구이 등)\n\nDay 2:\n오전: 우메다 스카이 빌딩에서 오사카 전경 감상하기\n오후: 유니버설 스튜디오 재팬에서 놀기\n저녁: 구로몬시장에서 신선한 해산물 맛보기\n\nDay 3:\n오전: 츠루하시 아쿠아리움에서 수중 동물들 구경하기\n오후: 난바 워크에서 쇼핑하기\n저녁: 신세카이에서 타코야끼와 맥주 즐기기\n위 일정은 추천 일정으로, 여행자분들의 취향이나 일정에 따라 유동적으로 변경이 가능합니다. 또한 교통편과 숙소 등도 고려해야 하기 때문에 자세한 일정은 여행 계획을 세우실 때 참고하시면 좋을 것 같습니다.',
      },
      {
        prompt: '2일차에 유니버설 스튜디오에는 탈 것들이 어떤게 있나요?',
        answer:
          '유니버설 스튜디오 재팬은 세계적으로 유명한 테마파크 중 하나로, 다양한 탈 것들과 즐길거리가 있습니다.\n유니버설 스튜디오 재팬에서는 다양한 탈 것들이 준비되어 있습니다. 대표적으로는 해리 포터 테마 존의 "포터와 비밀의 방", "포터와 마법사 동료들", "포터와 금니츠" 등이 있습니다. 또한, 할리우드 영화 "쥬라기 공원"을 모티브로 한 "쥬라기 월드"와 "타임 머신" 등 다양한 라이드가 있습니다.\n그 외에도 "뉴욕" 테마 존의 "스파이더맨 더 라이드", "서부영화" 테마 존의 "와일드 웨스트 어드벤처" 등도 인기 있는 탈 것들 중 하나입니다.\n유니버설 스튜디오 재팬은 탈 것 외에도 다양한 쇼, 캐릭터 만남, 음식점 등도 마련되어 있으므로 즐길거리가 많은 곳입니다.',
      },
      {
        prompt: '안에서 먹을 만한 음식도 많은가요?',
        answer:
          '네, 유니버설 스튜디오 재팬 안에는 다양한 음식점이 있습니다. 각각의 테마 존에 맞는 음식들이 준비되어 있어 여행자분들이 즐길 수 있는 다양한 메뉴들을 제공하고 있습니다.\n해리 포터 테마 존에는 버터맥주와 버터맥주 아이스크림, 그리고 "허니듀크" 같은 해리 포터 시리즈에 등장하는 음식들을 맛볼 수 있습니다.\n"뉴욕" 테마 존에는 퓨리토스나 핫도그, 그리고 뉴욕 풍미의 스파게티 등이 준비되어 있습니다.\n"서부영화" 테마 존에는 버거와 감자튀김, 그리고 코뿔소 스테이크 등이 준비되어 있습니다.\n이 외에도 각 테마 존마다 특색있는 음식점들이 많으므로, 즐길거리와 먹거리가 풍부한 유니버설 스튜디오 재팬에서 다양한 음식을 즐겨보시는 것도 추천드립니다.',
      },
    ],
    addQuestion:
      '1. 대략적인 비용이 어느 정도 발생할까요?\n2. 그날 날씨가 괜찮을까요?\n3. 3일차에 마실 맥주를 미리 추천해줄 수 있을까요?',
  },
];
