export const TAG_LIST = [
  {
    id: 0,
    name: '공감',
    list: [
      { id: 0, text: '안녕! 반가워 :)' },
      { id: 1, text: '나의 친구가 되어주겠니?' },
      { id: 2, text: '오늘 기분이 좋지 않은데, 대화 상대가 되어주겠어?' },
      { id: 3, text: '너와 대화해보고 싶어!' },
      { id: 4, text: '어떻게 하면 친구를 많이 사귈 수 있을까?' },
      { id: 5, text: '나는 인싸가 되고 싶은데 어떻게 하면 가능할까?' },
      { id: 6, text: '관심을 많이 받고 싶은데! 나도 가능할까?' },
      { id: 7, text: '내 MBTI는 ESTP야, 너는 MBTI가 뭐야?' },
      { id: 8, text: '너는 참 친절하구나?' },
    ],
  },
  {
    id: 1,
    name: '여행',
    list: [
      { id: 0, text: '여행을 계획할 때, 가장 중요한 것은 무엇인가요?' },
      { id: 1, text: '여행을 떠나기 전에 꼭 준비해야 할 것은 무엇인가요?' },
      { id: 2, text: '여행 중에 현지인과 잘 소통하는 방법에 대해 알고 싶어요.' },
      { id: 3, text: '여행 중 현지 음식을 먹을 때 주의해야할 점이 있나요?' },
      { id: 4, text: '가장 멀리 떨어진 나라는 어디고 어떻게 갈 수 있나요?' },
      { id: 5, text: '세계에서 가장 아름다운 해변은 어디에 있고, 어떻게 갈 수 있나요?' },
      { id: 6, text: '세계에서 가장 오래된 건축물은 어디이고, 어떻게 갈 수 있나요?' },
      { id: 7, text: '봄에 가면 좋을 국내 여행지 5개만 추천해주세요.' },
      { id: 8, text: '해외 여행을 계획할 때 꼭 필요한 준비물을 알려주세요.' },
    ],
  },
  {
    id: 2,
    name: '주식',
    list: [
      { id: 0, text: '주식 시장에서 거래되는 주식 종류는 어떤 것이 있나요?' },
      { id: 1, text: '주식을 사기 전에 어떤 조사를 하면 좋을까요?' },
      { id: 2, text: '주식 시장에서 매수와 매도의 차이점은 무엇인가요?' },
      { id: 3, text: '주식의 가격은 어떤 요인에 의해 결정되나요?' },
      { id: 4, text: '주식이란 도대체 무엇인가요?' },
      { id: 5, text: '주식 분할이란 무엇인가요? 그것이 주식 가격에 어떤 영향을 미치나요?' },
      { id: 6, text: '주식 배당금을 받기 위해서는 어떤 조건이 필요한가요?' },
      { id: 7, text: '주식을 사는 방법에 대해 알려주세요.' },
      { id: 8, text: '해외 주식을 사는 방법에 대해 알려주세요.' },
    ],
  },
  {
    id: 3,
    name: '개발',
    list: [
      { id: 0, text: '객체 지향 프로그래밍이란 무엇인가?' },
      { id: 1, text: '변수와 상수의 차이점은 무엇인가요?' },
      { id: 2, text: '알고리즘이란 무엇이고 어떻게 작동하나요?' },
      { id: 3, text: '알고리즘의 시간 복잡도와 공간 복잡도는 무엇을 의미하나요?' },
      { id: 4, text: '자료구조에서 스택과 큐의 차이점은 무엇인가요?' },
      { id: 5, text: '프로그램에서 스택과 힙 메모리의 차이점은 무엇인가요?' },
      { id: 6, text: '개발자가 되는 방법에 대해 알려주세요.' },
      { id: 7, text: '자료구조 중 연결리스트와 배열의 차이점은 무엇인가요?' },
      { id: 8, text: '프론트엔드 개발자와 백엔드 개발자의 차이는 무엇인가요?' },
    ],
  },
];

export const CHARACTER_LIST = [
  { id: 0, name: 'enfp', character: '엔프피', description: '반가와! 나는 MBTI 중독이야, 나랑 같이 놀아!!' },
  { id: 1, name: 'travel', character: '여행에 미친자', description: '어딘가로 떠나고 싶다고? 전부 내게 물어봐!' },
  { id: 2, name: 'dog', character: 'IQ 50, 골든 리트리버', description: '멍...?' }
]
